/*
Задание: Найти y по вводимому х
Ограничения: [-10^10 ; 10^10]
Автор: Макарова Юлиана Игоревна, гр. 4342
Версия: 1.1
Даты: начало 22.09.24   конец 24.09.24
*/

#include <iostream>
#include <iomanip>

int main()
{
    setlocale(LC_CTYPE, "RU");
    std::cout << " y^\n a|---*****--------\n  | *   |   *\n 0|*____|____*_____\n  |     a     *   *\n  |            ***\n-a|---------------\n\n";
    std::cout << "Privet" << std::endl;
    float a, x, y, x0, y0; bool fl = 0;

    std::cout << "Задание: Найти по (x, y) входит ли точка в границы функции\nОграничения: [-10 ^ 10; 10 ^ 10]\nАвтор : Макарова Юлиана Игоревна, гр. 4342\nВерсия : 1.0\nДаты : начало 03.09.24   конец 24.09.24\n\n";

    std::cout << "Введите a: "; std::cin >> a;
    std::cout << "Введите x[-8*a, 8*a]: "; std::cin >> x;
    std::cout << "Введите y[-10^10, 10^10]: "; std::cin >> y;

    x0 = fmod(fabs(x), fabs(3 * a));
    y0 = fmod(y, fabs(3 * a));

    if (a > 0 && x >= 0 && x <= 8*a) {
        if ((x0 <= 2 * a) && (y0 >= 0 && y0 <= sqrtf(fabs((a * a) - (x0 - a) * (x0 - a))))) { fl = 1; }
        else if ((x0 >= 2 * a && x0 <= 3 * a) && (y0 <= 0 && y0 >= -sqrtf(fabs(((a * a) / 4) - (x0 - 2.5 * a) * (x0 - 2.5 * a))))) { fl = 1; }
        else { fl = 0; }
    }
    else if ((a < 0) && (x <= 0) && (x >= 8 * a)) {
        a = fabs(a);
        if ((x0 <= 2 * a) && (y0 <= 0 && y0 >= -sqrtf(fabs((a * a) - (x0 - a) * (x0 - a))))) { fl = 1; }
        else if ((x0 >= 2 * a && x0 <= 3 * a) && (y0 >= 0 && y0 <= sqrtf(fabs(((a * a) / 4) - (x0 - 2.5 * a) * (x0 - 2.5 * a))))) { fl = 1; }
        else { fl = 0; }
    }
    else {
        if (x == 0 && y == 0) { fl = 1; }
    }

    if (fl == 1) { std::cout << "\nточка с координатами (" << x << ", " << y << ")" << " принадлежит области\n"; }
    else { std::cout << "\nточка с координатами (" << x << ", " << y << ")" << " НЕ принадлежит области\n"; }

    std::cout << "Hello world!" << std::endl;
}
